{
    "work_experiences":[ 
        {
            "name":"Senior Machine Learning Engineer - [EvolutionIQ](https://www.evolutioniq.com/)",
            "dates":"March 2024-Present",
            "description":"AI powered disability insurance claims management and automatic documentation",
            "skills":[
                "**Improved automated ICD-10 coding precison by 25%** (absolute) by redesigning and reimplementing our medical NER system with updated NLP logic and LLMs.",
                "**Accelerated insurance claim duration and resolution modeling by 3x** through optimizing our hyperparameter tuning and sweeping in Weights and Biases.",
                "**Optimized data labeling workflows for speed and reliability** by implementing LLM based auto-labeling and introducing labeling guidelines and inter-annotator agreement metrics"
            ]
        },
        {
            "name":"AI/ML Engineer - Lenora Systems",
            "dates":"October 2023-February 2024",
            "description":"AI/ML Consultant for AmeriHealth Caritas, a Medicaid managed care organization",
            "skills":[
                "**Pioneered generative AI applications in contract intelligence** through designing and implementing a **LangChain based Retrieval Augmented (RAG) chatbot** for chat-based analysis of health insurance contracts **within only 2 months**.",
                "Saved development time and money by utilizing open source **LLM and vector database infrastructure** with Llama2-70B and FAISS vector storage for easy portability.",
                "**Increased LLM testing velocity by 10x** through implementing a parallelized testing scheme for chatbot accuracy analysis."
            ]
        },
        {
            "name":"Data Scientist - [Corti](https://www.corti.ai/)",
            "dates":"August 2021-August 2023",
            "description":"AI driven emergency medical consulation analysis, disease detection and automated triage",
            "skills":[
                "Led NLP projects including automatic **call clustering with BERT embeddings**, Question and **NER entity detection** with LSTM based classification models and Bag of Word models. ",
                "**Identified model drift** in several ML models through designing and implementing MLOps techniques such as metrics and tests for **monitoring ML models** and search services.",
                "Enabled automated tracking of conversation quality for call taker training and medical quality assurance of **1M emergency medical calls per year** through designing and implementing an **NLP search** and ingestion API for call text on top of **Elasticsearch**."
            ]
        },
        {
            "name":"Data Scientist - [Min Doktor Healthcare AB](https://www.mindoktor.se/)",
            "dates":"August 2018-August 2021",
            "description":"Text and image-based automated triage and treatment for low acuity primary care.",
            "skills":[
                "**Enabled innovative Data Science workflows** through designing and implementing a **data warehouse** with automated, tested **ETL pipelines**, **custom encryption** for GDPR and HIPAA compliance, and domain modelled data with visualization in Looker.",
                "Enhanced patient experience by **building, evaluating and monitoring NLP classification models** for symptom search and **improved marketing responsiveness to patient Churn** with statistical predictive models such as customer Lifetime Value."
            ]
        }

    ],
    "academics":[ 
        {
            "name":"Msc. in Mathematical Statistics",
            "dates":"August 2017-August 2019",
            "description":"Lund Univeristy (Sweden) Department of Mathematics",
            "skills":[
                "Thesis: [Emotion Classification with Natural Language Processing](https://www.researchgate.net/publication/339697919)",
                "Advisor: Pierre Nugues, Associate Professor Dept. of Computer Science Lund University"
            ]
        },
        {
            "name":"Bsc. Honours in Statistical Sciences",
            "dates":"January 2013-December 2016",
            "description":"University of Cape Town (South Africa) Department of Statistical Sciences",
            "skills":[
                "Thesis: [Uses of Principal Components in Generalized Linear Modelling](https://www.researchgate.net/publication/310949785)",
                "3rd Place Winner of the South African Statistical Association Honours Thesis competition"
            ]
        }
    ],
    "skills":[
        {
            "name":"Programming Languages",
            "dates":" ",
            "description":"Python (Advanced), SQL, Bash, R (Intermediate), C++, Java, Scala (Basic)",
            "skills":[
            ]
        },
        {
            "name":"Tools",
            "dates":" ",
            "description":"Deployment (Docker, Kubernetes), Cloud (Azure, Google Cloud), SQL (Postgres, BigQuery, Mssql), NoSQL (MongoDB, Elasticsearch, Lucene), Source Control (Git), Acceleration (Cuda)",
            "skills":[
            ]
        },
        {
            "name":"Skills",
            "dates":" ",
            "description":"Testing (pytest), Machine Learning (pytorch, tensorflow, scikit-learn, xgboost, huggingface), NLP (spacy, nltk), Mathematical Programming (scipy, numpy), Data Analysis and Visualization (pandas, Matplotlib), Web Development (FastApi, Streamlit, Django), MLOps (ClearML, Weights and Biases), Data Modeling (DBT, Great Expectations), Workflow Management (Airflow, Prefect)",
            "skills":[
            ]
        }

    ]
}
